Conf.Simple/src/InformationRegisters/SUI_ГрупповойПересчет/SUI_ГрупповойПересчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ГрупповойПересчет</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОбмена</name>
    <type>
      <types>DocumentRef.SUI_ДокументОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ГрупповойПересчет/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьДанные(МобильноеУстройство, ДокументОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИдентификаторСтроки КАК id,
		|	Номенклатура КАК product_id,
		|	Характеристика КАК property_id,
		|	Упаковка КАК unit_id,
		|	Серия КАК series_id,
		|	Ячейка КАК cell_id,
		|	СУММА(КоличествоФакт) КАК qty,
		|	СУММА(ВЫБОР
		|		КОГДА МобильноеУстройство = &МобильноеУстройство
		|			ТОГДА КоличествоФакт
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК qty_delta
		|ИЗ
		|	РегистрСведений.SUI_ГрупповойПересчет
		|ГДЕ
		|	ДокументОбмена = &ДокументОбмена
		|СГРУППИРОВАТЬ ПО
		|	ИдентификаторСтроки,
		|	Номенклатура,
		|	Характеристика,
		|	Упаковка,
		|	Серия,
		|	Ячейка";
	
	Запрос.УстановитьПараметр("ДокументОбмена", ДокументОбмена);
	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ЗаписатьДанные(МобильноеУстройство, ДокументОбмена, ДанныеСтрокПересчета, Перезаписать) Экспорт
	
	Если Перезаписать Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	SUI_ГрупповойПересчет.ИдентификаторЗаписи,
			|	SUI_ГрупповойПересчет.ДокументОбмена,
			|	SUI_ГрупповойПересчет.ИдентификаторСтроки,
			|	SUI_ГрупповойПересчет.Период
			|ИЗ
			|	РегистрСведений.SUI_ГрупповойПересчет КАК SUI_ГрупповойПересчет
			|ГДЕ
			|	SUI_ГрупповойПересчет.ДокументОбмена = &ДокументОбмена
			|ДЛЯ ИЗМЕНЕНИЯ
			|	РегистрСведений.SUI_ГрупповойПересчет";
		
		Запрос.УстановитьПараметр("ДокументОбмена", ДокументОбмена);
		
		НачатьТранзакцию();
		
		Попытка
			
			Запрос.Выполнить();
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументОбмена.Установить(ДокументОбмена);
			НаборЗаписей.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ТекущийПериод = ТекущаяДатаСеанса();
		
		Для Каждого ДанныеСтрокиПересчет Из ДанныеСтрокПересчета Цикл
			
			Если ДанныеСтрокиПересчет.is_new Тогда
				ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ДанныеСтрокиПересчет.product_id),
					СтрШаблон(НСтр("ru = 'Для строки %1 не заполнен идентификатор товара.'"), ДанныеСтрокиПересчет.id));
			КонецЕсли;
			
			Запись = СоздатьМенеджерЗаписи();
			Запись.Период = ТекущийПериод;
			Запись.ДокументОбмена = ДокументОбмена;
			Запись.ИдентификаторЗаписи = Новый УникальныйИдентификатор();
			Запись.ИдентификаторСтроки = ДанныеСтрокиПересчет.id;
			Запись.Номенклатура = ДанныеСтрокиПересчет.product_id;
			Запись.Характеристика = ДанныеСтрокиПересчет.property_id;
			Запись.Упаковка = ДанныеСтрокиПересчет.unit_id;
			Запись.Ячейка = ДанныеСтрокиПересчет.cell_id;
			Запись.Серия = ДанныеСтрокиПересчет.series_id;
			Запись.КоличествоФакт = ДанныеСтрокиПересчет.qty;
			Запись.ИдентификаторСтроки = ДанныеСтрокиПересчет.id;
			Запись.МобильноеУстройство = МобильноеУстройство;
			Запись.МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
			Запись.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции

Процедура УдалитьДанные(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Период,
		|	ИдентификаторЗаписи,
		|	ДокументОбмена,
		|	ИдентификаторСтроки
		|ИЗ
		|	РегистрСведений.SUI_ГрупповойПересчет
		|ГДЕ
		|	&Условия
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрСведений.SUI_ГрупповойПересчет";
	
	Условия = Новый Массив();
	
	Для Каждого Параметр Из Параметры Цикл
		
		ТипЗначенияПараметра = ТипЗнч(Параметр.Значение);
		
		Если ТипЗначенияПараметра = Тип("Массив") Или
			ТипЗначенияПараметра = Тип("ФиксированныйМассив") Или
			ТипЗначенияПараметра = Тип("СписокЗначений") Тогда
			Условия.Добавить(Параметр.Ключ + " В (&" + Параметр.Ключ + ")");
		Иначе
			Условия.Добавить(Параметр.Ключ + " = &" + Параметр.Ключ);
		КонецЕсли;
		
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
		
	КонецЦикла;
	
	Условия = СтрСоединить(Условия, Символы.ПС + Символы.Таб + "И ");
	
	Если ПустаяСтрока(Условия) Тогда
		Условия = "ИСТИНА";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условия", Условия);
	
	НачатьТранзакцию();
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
				НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(Выборка.ИдентификаторЗаписи);
				НаборЗаписей.Отбор.ИдентификаторСтроки.Установить(Выборка.ИдентификаторСтроки);
				НаборЗаписей.Отбор.ДокументОбмена.Установить(Выборка.ДокументОбмена);
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
